Revit 2027 API
DataTransferProgressChangedEventArgs Class
 The event arguments used during the data transferring phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged].
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
 Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DataTransferProgressChangedEventArgs : WorksharedOperationProgressChangedEventArgs
Public Class DataTransferProgressChangedEventArgs
	Inherits WorksharedOperationProgressChangedEventArgs
public ref class DataTransferProgressChangedEventArgs : public WorksharedOperationProgressChangedEventArgs
type DataTransferProgressChangedEventArgs =
    class
        inherit WorksharedOperationProgressChangedEventArgs
    end
The DataTransferProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
FinishedSize |  The transferred data size, in bytes, since the last time this event was raised.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Location |  Full path of the central model which is to be operated.
(Inherited from WorksharedOperationProgressChangedEventArgs)
Speed |  Speed(bytes/second) in this event.
Status |  Gets API event status, reflect current operation execution status.
(Inherited from WorksharedOperationProgressChangedEventArgs)
TotalSize |  Total expected data size to transfer, in bytes.
TransferMode |  Data transfer mode in this event.
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.
See Also
Reference
Autodesk.Revit.DB.Events Namespace